using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace NImage
{
    class Image
    {
        #region enum과 배열(아래 코드) 차이점
        /*
         
        구분	        enum	                            배열
        정의 목적	    의미 있는 이름들의 고정 목록	    값을 나열해서 저장하는 자료 구조
        메모리	        각각이 정수형(기본값 0부터)	        메모리에 값들이 나열되어 있음
        사용 예	        상태, 종류, 타입을 구분	            여러 데이터를 저장/순회
        예시	        EItem.speedUp	                    playerRenders[0]
        
         */
        #endregion
        #region 플레이어 점프 모션
        string[] playerRenders =
        {
            // 0
	        @"       " + '\n' +
            @"       " + '\n' +
            @"   _O  " + '\n' +
            @"  |/|_ " + '\n' +
            @"  /\   " + '\n' +
            @" /  |  ",
	        // 1
	        @"       " + '\n' +
            @"       " + '\n' +
            @"       " + '\n' +
            @"    O  " + '\n' +
            @"  </L  " + '\n' +
            @"   /|  ",
	        // 2
	        @"       " + '\n' +
            @"    /O/" + '\n' +
            @"    /  " + '\n' +
            @"   //  " + '\n' +
            @"  //   " + '\n' +
            @"       ",
	        // 3
	        @"  __O__" + '\n' +
            @" /     " + '\n' +
            @"//     " + '\n' +
            @"       " + '\n' +
            @"       " + '\n' +
            @"       ",
	        // 4
	        @"  __   " + '\n' +
            @" // \O " + '\n' +
            @"     \\" + '\n' +
            @"       " + '\n' +
            @"       " + '\n' +
            @"       ",
	        // 5
	        @"  __   " + '\n' +
            @" //_O\ " + '\n' +
            @"       " + '\n' +
            @"       " + '\n' +
            @"       " + '\n' +
            @"       ",
	        // 6
	        @"  __\  " + '\n' +
            @" _O/   " + '\n' +
            @"       " + '\n' +
            @"       " + '\n' +
            @"       " + '\n' +
            @"       ",
	        // 7
	        @" \O\__ " + '\n' +
            @"     \\" + '\n' +
            @"       " + '\n' +
            @"       " + '\n' +
            @"       ",
	        // 8
	        @"       " + '\n' +
            @"       " + '\n' +
            @"   O   " + '\n' +
            @"  L|L  " + '\n' +
            @"   |_  " + '\n' +
            @"  /  | ",
             
        
        };
        #endregion

    }
}
